; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	thermograph3 - mode
	thermograph2 - mode
	image1 - mode
	thermograph0 - mode
	Star1 - direction
	Star6 - direction
	GroundStation8 - direction
	Star11 - direction
	Star10 - direction
	GroundStation5 - direction
	Star0 - direction
	Star9 - direction
	Star2 - direction
	GroundStation7 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Planet12 - direction
	Planet13 - direction
	Planet14 - direction
	Planet15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star10)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
	(supports instrument1 thermograph2)
	(supports instrument1 thermograph0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation8)
	(supports instrument2 thermograph2)
	(supports instrument2 thermograph0)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star9)
	(calibration_target instrument2 Star0)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star11)
	(supports instrument3 thermograph0)
	(supports instrument3 thermograph2)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 GroundStation7)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation3)
)
(:goal (and
	(pointing satellite1 GroundStation3)
	(have_image Planet12 thermograph0)
	(have_image Planet13 thermograph3)
	(have_image Planet14 image1)
	(have_image Planet15 thermograph3)
	(have_image Star16 thermograph0)
))

)

; plan
1. (switch_on instrument3 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument3)
   goals met: 0 of 6
2. (calibrate satellite3 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 0 of 6
3. (turn_to satellite3 planet13 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 planet13)
   goals met: 0 of 6
4. (take_image satellite3 planet13 instrument3 thermograph3)
   added: (have_image planet13 thermograph3)
   goals met: 1 of 6
5. (turn_to satellite3 planet12 planet13)
   deleted: (pointing satellite3 planet13)
   added: (pointing satellite3 planet12)
   goals met: 1 of 6
6. (turn_to satellite1 groundstation4 groundstation8)
   deleted: (pointing satellite1 groundstation8)
   added: (pointing satellite1 groundstation4)
   goals met: 1 of 6
7. (take_image satellite3 planet12 instrument3 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 2 of 6
8. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 6
9. (calibrate satellite1 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 2 of 6
10. (turn_to satellite1 planet14 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 planet14)
   goals met: 2 of 6
11. (take_image satellite1 planet14 instrument1 image1)
   added: (have_image planet14 image1)
   goals met: 3 of 6
12. (turn_to satellite1 groundstation3 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 groundstation3)
   goals met: 4 of 6
13. (turn_to satellite3 planet15 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 planet15)
   goals met: 4 of 6
14. (take_image satellite3 planet15 instrument3 thermograph3)
   added: (have_image planet15 thermograph3)
   goals met: 5 of 6
15. (turn_to satellite3 star16 planet15)
   deleted: (pointing satellite3 planet15)
   added: (pointing satellite3 star16)
   goals met: 5 of 6
16. (take_image satellite3 star16 instrument3 thermograph0)
   added: (have_image star16 thermograph0)
   goals met: 6 of 6
